thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU810.h
/* RPINR32 */
#define _SS4R RPINR32bits.SS4R
#define _SS4R0 RPINR32bits.SS4R0
#define _SS4R1 RPINR32bits.SS4R1
#define _SS4R2 RPINR32bits.SS4R2
#define _SS4R3 RPINR32bits.SS4R3
#define _SS4R4 RPINR32bits.SS4R4
#define _SS4R5 RPINR32bits.SS4R5
#define _SS4R6 RPINR32bits.SS4R6

/* RPINR33 */
#define _IC9R RPINR33bits.IC9R
#define _IC10R RPINR33bits.IC10R
#define _IC9R0 RPINR33bits.IC9R0
#define _IC9R1 RPINR33bits.IC9R1
#define _IC9R2 RPINR33bits.IC9R2
#define _IC9R3 RPINR33bits.IC9R3
#define _IC9R4 RPINR33bits.IC9R4
#define _IC9R5 RPINR33bits.IC9R5
#define _IC9R6 RPINR33bits.IC9R6
#define _IC10R0 RPINR33bits.IC10R0
#define _IC10R1 RPINR33bits.IC10R1
#define _IC10R2 RPINR33bits.IC10R2
#define _IC10R3 RPINR33bits.IC10R3
#define _IC10R4 RPINR33bits.IC10R4
#define _IC10R5 RPINR33bits.IC10R5
#define _IC10R6 RPINR33bits.IC10R6

/* RPINR34 */
#define _IC11R RPINR34bits.IC11R
#define _IC12R RPINR34bits.IC12R
#define _IC11R0 RPINR34bits.IC11R0
#define _IC11R1 RPINR34bits.IC11R1
#define _IC11R2 RPINR34bits.IC11R2
#define _IC11R3 RPINR34bits.IC11R3
#define _IC11R4 RPINR34bits.IC11R4
#define _IC11R5 RPINR34bits.IC11R5
#define _IC11R6 RPINR34bits.IC11R6
#define _IC12R0 RPINR34bits.IC12R0
#define _IC12R1 RPINR34bits.IC12R1
#define _IC12R2 RPINR34bits.IC12R2
#define _IC12R3 RPINR34bits.IC12R3
#define _IC12R4 RPINR34bits.IC12R4
#define _IC12R5 RPINR34bits.IC12R5
#define _IC12R6 RPINR34bits.IC12R6

/* RPINR35 */
#define _IC13R RPINR35bits.IC13R
#define _IC14R RPINR35bits.IC14R
#define _IC13R0 RPINR35bits.IC13R0
#define _IC13R1 RPINR35bits.IC13R1
#define _IC13R2 RPINR35bits.IC13R2
#define _IC13R3 RPINR35bits.IC13R3
#define _IC13R4 RPINR35bits.IC13R4
#define _IC13R5 RPINR35bits.IC13R5
#define _IC13R6 RPINR35bits.IC13R6
#define _IC14R0 RPINR35bits.IC14R0
#define _IC14R1 RPINR35bits.IC14R1
#define _IC14R2 RPINR35bits.IC14R2
#define _IC14R3 RPINR35bits.IC14R3
#define _IC14R4 RPINR35bits.IC14R4
#define _IC14R5 RPINR35bits.IC14R5
#define _IC14R6 RPINR35bits.IC14R6

/* RPINR36 */
#define _IC15R RPINR36bits.IC15R
#define _IC16R RPINR36bits.IC16R
#define _IC15R0 RPINR36bits.IC15R0
#define _IC15R1 RPINR36bits.IC15R1
#define _IC15R2 RPINR36bits.IC15R2
#define _IC15R3 RPINR36bits.IC15R3
#define _IC15R4 RPINR36bits.IC15R4
#define _IC15R5 RPINR36bits.IC15R5
#define _IC15R6 RPINR36bits.IC15R6
#define _IC16R0 RPINR36bits.IC16R0
#define _IC16R1 RPINR36bits.IC16R1
#define _IC16R2 RPINR36bits.IC16R2
#define _IC16R3 RPINR36bits.IC16R3
#define _IC16R4 RPINR36bits.IC16R4
#define _IC16R5 RPINR36bits.IC16R5
#define _IC16R6 RPINR36bits.IC16R6

/* RPINR37 */
#define _OCFCR RPINR37bits.OCFCR
#define _SYNCI1R RPINR37bits.SYNCI1R
#define _OCFCR0 RPINR37bits.OCFCR0
#define _OCFCR1 RPINR37bits.OCFCR1
#define _OCFCR2 RPINR37bits.OCFCR2
#define _OCFCR3 RPINR37bits.OCFCR3
#define _OCFCR4 RPINR37bits.OCFCR4
#define _OCFCR5 RPINR37bits.OCFCR5
#define _OCFCR6 RPINR37bits.OCFCR6
#define _SYNCI1R0 RPINR37bits.SYNCI1R0
#define _SYNCI1R1 RPINR37bits.SYNCI1R1
#define _SYNCI1R2 RPINR37bits.SYNCI1R2
#define _SYNCI1R3 RPINR37bits.SYNCI1R3
#define _SYNCI1R4 RPINR37bits.SYNCI1R4
#define _SYNCI1R5 RPINR37bits.SYNCI1R5
#define _SYNCI1R6 RPINR37bits.SYNCI1R6

/* RPINR38 */
#define _SYNCI2R RPINR38bits.SYNCI2R
#define _DTCMP1R RPINR38bits.DTCMP1R
#define _SYNCI2R0 RPINR38bits.SYNCI2R0
#define _SYNCI2R1 RPINR38bits.SYNCI2R1
#define _SYNCI2R2 RPINR38bits.SYNCI2R2
#define _SYNCI2R3 RPINR38bits.SYNCI2R3
#define _SYNCI2R4 RPINR38bits.SYNCI2R4
#define _SYNCI2R5 RPINR38bits.SYNCI2R5
#define _SYNCI2R6 RPINR38bits.SYNCI2R6
#define _DTCMP1R0 RPINR38bits.DTCMP1R0
#define _DTCMP1R1 RPINR38bits.DTCMP1R1
#define _DTCMP1R2 RPINR38bits.DTCMP1R2
#define _DTCMP1R3 RPINR38bits.DTCMP1R3
#define _DTCMP1R4 RPINR38bits.DTCMP1R4
#define _DTCMP1R5 RPINR38bits.DTCMP1R5
#define _DTCMP1R6 RPINR38bits.DTCMP1R6

/* RPINR39 */
#define _DTCMP2R RPINR39bits.DTCMP2R
#define _DTCMP3R RPINR39bits.DTCMP3R
#define _DTCMP2R0 RPINR39bits.DTCMP2R0
#define _DTCMP2R1 RPINR39bits.DTCMP2R1
#define _DTCMP2R2 RPINR39bits.DTCMP2R2
#define _DTCMP2R3 RPINR39bits.DTCMP2R3
#define _DTCMP2R4 RPINR39bits.DTCMP2R4
#define _DTCMP2R5 RPINR39bits.DTCMP2R5
#define _DTCMP2R6 RPINR39bits.DTCMP2R6
#define _DTCMP3R0 RPINR39bits.DTCMP3R0
#define _DTCMP3R1 RPINR39bits.DTCMP3R1
#define _DTCMP3R2 RPINR39bits.DTCMP3R2
#define _DTCMP3R3 RPINR39bits.DTCMP3R3
#define _DTCMP3R4 RPINR39bits.DTCMP3R4
#define _DTCMP3R5 RPINR39bits.DTCMP3R5
#define _DTCMP3R6 RPINR39bits.DTCMP3R6

/* RPINR40 */
#define _DTCMP4R RPINR40bits.DTCMP4R
#define _DTCMP5R RPINR40bits.DTCMP5R
#define _DTCMP4R0 RPINR40bits.DTCMP4R0
#define _DTCMP4R1 RPINR40bits.DTCMP4R1
#define _DTCMP4R2 RPINR40bits.DTCMP4R2
#define _DTCMP4R3 RPINR40bits.DTCMP4R3
#define _DTCMP4R4 RPINR40bits.DTCMP4R4
#define _DTCMP4R5 RPINR40bits.DTCMP4R5
#define _DTCMP4R6 RPINR40bits.DTCMP4R6
#define _DTCMP5R0 RPINR40bits.DTCMP5R0
#define _DTCMP5R1 RPINR40bits.DTCMP5R1
#define _DTCMP5R2 RPINR40bits.DTCMP5R2
#define _DTCMP5R3 RPINR40bits.DTCMP5R3
#define _DTCMP5R4 RPINR40bits.DTCMP5R4
#define _DTCMP5R5 RPINR40bits.DTCMP5R5
#define _DTCMP5R6 RPINR40bits.DTCMP5R6

/* RPINR41 */
#define _DTCMP6R RPINR41bits.DTCMP6R
#define _DTCMP6R0 RPINR41bits.DTCMP6R0
#define _DTCMP6R1 RPINR41bits.DTCMP6R1
#define _DTCMP6R2 RPINR41bits.DTCMP6R2
#define _DTCMP6R3 RPINR41bits.DTCMP6R3
#define _DTCMP6R4 RPINR41bits.DTCMP6R4
#define _DTCMP6R5 RPINR41bits.DTCMP6R5
#define _DTCMP6R6 RPINR41bits.DTCMP6R6

/* RPINR42 */
#define _FLT5R RPINR42bits.FLT5R
#define _FLT6R RPINR42bits.FLT6R
#define _FLT5R0 RPINR42bits.FLT5R0
#define _FLT5R1 RPINR42bits.FLT5R1
#define _FLT5R2 RPINR42bits.FLT5R2
#define _FLT5R3 RPINR42bits.FLT5R3
#define _FLT5R4 RPINR42bits.FLT5R4
#define _FLT5R5 RPINR42bits.FLT5R5
#define _FLT5R6 RPINR42bits.FLT5R6
#define _FLT6R0 RPINR42bits.FLT6R0
#define _FLT6R1 RPINR42bits.FLT6R1
#define _FLT6R2 RPINR42bits.FLT6R2
#define _FLT6R3 RPINR42bits.FLT6R3
#define _FLT6R4 RPINR42bits.FLT6R4
#define _FLT6R5 RPINR42bits.FLT6R5
#define _FLT6R6 RPINR42bits.FLT6R6

/* RPINR43 */
#define _FLT7R RPINR43bits.FLT7R
#define _FLT7R0 RPINR43bits.FLT7R0
#define _FLT7R1 RPINR43bits.FLT7R1
#define _FLT7R2 RPINR43bits.FLT7R2
#define _FLT7R3 RPINR43bits.FLT7R3
#define _FLT7R4 RPINR43bits.FLT7R4
#define _FLT7R5 RPINR43bits.FLT7R5
#define _FLT7R6 RPINR43bits.FLT7R6

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _NVMSIDL NVMCONbits.NVMSIDL
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3

/* NVMADRU */
#define _NVMADRU NVMADRUbits.NVMADRU

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _VREGSF RCONbits.VREGSF
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _LPOSCEN OSCCONbits.LPOSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLPRE CLKDIVbits.PLLPRE
#define _PLLPOST CLKDIVbits.PLLPOST
#define _FRCDIV CLKDIVbits.FRCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _PLLPRE0 CLKDIVbits.PLLPRE0
#define _PLLPRE1 CLKDIVbits.PLLPRE1
#define _PLLPRE2 CLKDIVbits.PLLPRE2
#define _PLLPRE3 CLKDIVbits.PLLPRE3
#define _PLLPRE4 CLKDIVbits.PLLPRE4
#define _PLLPOST0 CLKDIVbits.PLLPOST0
#define _PLLPOST1 CLKDIVbits.PLLPOST1
#define _FRCDIV0 CLKDIVbits.FRCDIV0
#define _FRCDIV1 CLKDIVbits.FRCDIV1
#define _FRCDIV2 CLKDIVbits.FRCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* PLLFBD */
#define _PLLDIV PLLFBDbits.PLLDIV
#define _PLLDIV0 PLLFBDbits.PLLDIV0
#define _PLLDIV1 PLLFBDbits.PLLDIV1
#define _PLLDIV2 PLLFBDbits.PLLDIV2
#define _PLLDIV3 PLLFBDbits.PLLDIV3
#define _PLLDIV4 PLLFBDbits.PLLDIV4
#define _PLLDIV5 PLLFBDbits.PLLDIV5
#define _PLLDIV6 PLLFBDbits.PLLDIV6
#define _PLLDIV7 PLLFBDbits.PLLDIV7
#define _PLLDIV8 PLLFBDbits.PLLDIV8

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* REFOCON */
#define _RODIV REFOCONbits.RODIV
#define _ROSEL REFOCONbits.ROSEL
#define _ROSSLP REFOCONbits.ROSSLP
#define _ROON REFOCONbits.ROON
#define _RODIV0 REFOCONbits.RODIV0
#define _RODIV1 REFOCONbits.RODIV1
#define _RODIV2 REFOCONbits.RODIV2
#define _RODIV3 REFOCONbits.RODIV3

/* ACLKCON3 */
#define _APLLPRE ACLKCON3bits.APLLPRE
#define _APLLPOST ACLKCON3bits.APLLPOST
#define _FRCSEL ACLKCON3bits.FRCSEL
#define _ASRCSEL ACLKCON3bits.ASRCSEL
#define _AOSCMD ACLKCON3bits.AOSCMD
#define _SELACLK ACLKCON3bits.SELACLK
#define _APLLCK ACLKCON3bits.APLLCK
#define _ENAPLL ACLKCON3bits.ENAPLL
#define _APPLPRE0 ACLKCON3bits.APPLPRE0
#define _APPLPRE1 ACLKCON3bits.APPLPRE1
#define _APPLPRE2 ACLKCON3bits.APPLPRE2
#define _APLLPOST0 ACLKCON3bits.APLLPOST0
#define _APLLPOST1 ACLKCON3bits.APLLPOST1
#define _APLLPOST2 ACLKCON3bits.APLLPOST2
#define _AOSCMD0 ACLKCON3bits.AOSCMD0
#define _AOSCMD1 ACLKCON3bits.AOSCMD1

/* ACLKDIV3 */
#define _APLLDIV ACLKDIV3bits.APLLDIV
#define _APLLDIV0 ACLKDIV3bits.APLLDIV0
#define _APLLDIV1 ACLKDIV3bits.APLLDIV1
#define _APLLDIV2 ACLKDIV3bits.APLLDIV2

/* PMD1 */
#define _AD1MD PMD1bits.AD1MD
#define _C1MD PMD1bits.C1MD
#define _C2MD PMD1bits.C2MD
#define _SPI1MD PMD1bits.SPI1MD
#define _SPI2MD PMD1bits.SPI2MD
#define _U1MD PMD1bits.U1MD
#define _U2MD PMD1bits.U2MD
#define _I2C1MD PMD1bits.I2C1MD
#define _DCIMD PMD1bits.DCIMD
#define _PWMMD PMD1bits.PWMMD
#define _QEI1MD PMD1bits.QEI1MD
#define _T1MD PMD1bits.T1MD
#define _T2MD PMD1bits.T2MD
#define _T3MD PMD1bits.T3MD
#define _T4MD PMD1bits.T4MD
#define _T5MD PMD1bits.T5MD

/* PMD2 */
#define _OC1MD PMD2bits.OC1MD
#define _OC2MD PMD2bits.OC2MD
#define _OC3MD PMD2bits.OC3MD
#define _OC4MD PMD2bits.OC4MD
#define _OC5MD PMD2bits.OC5MD
#define _OC6MD PMD2bits.OC6MD
#define _OC7MD PMD2bits.OC7MD
#define _OC8MD PMD2bits.OC8MD
#define _IC1MD PMD2bits.IC1MD
#define _IC2MD PMD2bits.IC2MD
#define _IC3MD PMD2bits.IC3MD
#define _IC4MD PMD2bits.IC4MD
#define _IC5MD PMD2bits.IC5MD
#define _IC6MD PMD2bits.IC6MD
#define _IC7MD PMD2bits.IC7MD
#define _IC8MD PMD2bits.IC8MD

/* PMD3 */
#define _AD2MD PMD3bits.AD2MD
#define _I2C2MD PMD3bits.I2C2MD
#define _U3MD PMD3bits.U3MD
#define _QEI2MD PMD3bits.QEI2MD
#define _DAC1MD PMD3bits.DAC1MD
#define _CRCMD PMD3bits.CRCMD
#define _PMPMD PMD3bits.PMPMD
#define _RTCCMD PMD3bits.RTCCMD
#define _CMPMD PMD3bits.CMPMD
#define _T6MD PMD3bits.T6MD
#define _T7MD PMD3bits.T7MD
#define _T8MD PMD3bits.T8MD
#define _T9MD PMD3bits.T9MD

/* PMD4 */
#define _USB1MD PMD4bits.USB1MD
#define _REFOMD PMD4bits.REFOMD
#define _U4MD PMD4bits.U4MD

/* PMD5 */
#define _OC9MD PMD5bits.OC9MD
#define _OC10MD PMD5bits.OC10MD
#define _OC11MD PMD5bits.OC11MD
#define _OC12MD PMD5bits.OC12MD
#define _OC13MD PMD5bits.OC13MD
#define _OC14MD PMD5bits.OC14MD
#define _OC15MD PMD5bits.OC15MD
#define _OC16MD PMD5bits.OC16MD
#define _IC9MD PMD5bits.IC9MD
#define _IC10MD PMD5bits.IC10MD
#define _IC11MD PMD5bits.IC11MD
#define _IC12MD PMD5bits.IC12MD
#define _IC13MD PMD5bits.IC13MD
#define _IC14MD PMD5bits.IC14MD
#define _IC15MD PMD5bits.IC15MD
#define _IC16MD PMD5bits.IC16MD

