thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU810.h
/* IPC13 */
#define _T9IP IPC13bits.T9IP
#define _INT3IP IPC13bits.INT3IP
#define _INT4IP IPC13bits.INT4IP
#define _C2RXIP IPC13bits.C2RXIP
#define _T9IP0 IPC13bits.T9IP0
#define _T9IP1 IPC13bits.T9IP1
#define _T9IP2 IPC13bits.T9IP2
#define _INT3IP0 IPC13bits.INT3IP0
#define _INT3IP1 IPC13bits.INT3IP1
#define _INT3IP2 IPC13bits.INT3IP2
#define _INT4IP0 IPC13bits.INT4IP0
#define _INT4IP1 IPC13bits.INT4IP1
#define _INT4IP2 IPC13bits.INT4IP2
#define _C2RXIP0 IPC13bits.C2RXIP0
#define _C2RXIP1 IPC13bits.C2RXIP1
#define _C2RXIP2 IPC13bits.C2RXIP2

/* IPC14 */
#define _C2IP IPC14bits.C2IP
#define _PSEMIP IPC14bits.PSEMIP
#define _QEI1IP IPC14bits.QEI1IP
#define _DCIEIP IPC14bits.DCIEIP
#define _C2IP0 IPC14bits.C2IP0
#define _C2IP1 IPC14bits.C2IP1
#define _C2IP2 IPC14bits.C2IP2
#define _PSEMIP0 IPC14bits.PSEMIP0
#define _PSEMIP1 IPC14bits.PSEMIP1
#define _PSEMIP2 IPC14bits.PSEMIP2
#define _QEI1IP0 IPC14bits.QEI1IP0
#define _QEI1IP1 IPC14bits.QEI1IP1
#define _QEI1IP2 IPC14bits.QEI1IP2
#define _DCIEIP0 IPC14bits.DCIEIP0
#define _DCIEIP1 IPC14bits.DCIEIP1
#define _DCIEIP2 IPC14bits.DCIEIP2

/* IPC15 */
#define _DCIIP IPC15bits.DCIIP
#define _DMA5IP IPC15bits.DMA5IP
#define _RTCIP IPC15bits.RTCIP
#define _DCIIP0 IPC15bits.DCIIP0
#define _DCIIP1 IPC15bits.DCIIP1
#define _DCIIP2 IPC15bits.DCIIP2
#define _DMA5IP0 IPC15bits.DMA5IP0
#define _DMA5IP1 IPC15bits.DMA5IP1
#define _DMA5IP2 IPC15bits.DMA5IP2
#define _RTCIP0 IPC15bits.RTCIP0
#define _RTCIP1 IPC15bits.RTCIP1
#define _RTCIP2 IPC15bits.RTCIP2

/* IPC16 */
#define _U1EIP IPC16bits.U1EIP
#define _U2EIP IPC16bits.U2EIP
#define _CRCIP IPC16bits.CRCIP
#define _U1EIP0 IPC16bits.U1EIP0
#define _U1EIP1 IPC16bits.U1EIP1
#define _U1EIP2 IPC16bits.U1EIP2
#define _U2EIP0 IPC16bits.U2EIP0
#define _U2EIP1 IPC16bits.U2EIP1
#define _U2EIP2 IPC16bits.U2EIP2
#define _CRCIP0 IPC16bits.CRCIP0
#define _CRCIP1 IPC16bits.CRCIP1
#define _CRCIP2 IPC16bits.CRCIP2

/* IPC17 */
#define _DMA6IP IPC17bits.DMA6IP
#define _DMA7IP IPC17bits.DMA7IP
#define _C1TXIP IPC17bits.C1TXIP
#define _C2TXIP IPC17bits.C2TXIP
#define _DMA6IP0 IPC17bits.DMA6IP0
#define _DMA6IP1 IPC17bits.DMA6IP1
#define _DMA6IP2 IPC17bits.DMA6IP2
#define _DMA7IP0 IPC17bits.DMA7IP0
#define _DMA7IP1 IPC17bits.DMA7IP1
#define _DMA7IP2 IPC17bits.DMA7IP2
#define _C1TXIP0 IPC17bits.C1TXIP0
#define _C1TXIP1 IPC17bits.C1TXIP1
#define _C1TXIP2 IPC17bits.C1TXIP2
#define _C2TXIP0 IPC17bits.C2TXIP0
#define _C2TXIP1 IPC17bits.C2TXIP1
#define _C2TXIP2 IPC17bits.C2TXIP2

/* IPC18 */
#define _PSESMIP IPC18bits.PSESMIP
#define _QEI2IP IPC18bits.QEI2IP
#define _PSESMIP0 IPC18bits.PSESMIP0
#define _PSESMIP1 IPC18bits.PSESMIP1
#define _PSESMIP2 IPC18bits.PSESMIP2
#define _QEI2IP0 IPC18bits.QEI2IP0
#define _QEI2IP1 IPC18bits.QEI2IP1
#define _QEI2IP2 IPC18bits.QEI2IP2

/* IPC20 */
#define _U3EIP IPC20bits.U3EIP
#define _U3RXIP IPC20bits.U3RXIP
#define _U3TXIP IPC20bits.U3TXIP
#define _U3EIP0 IPC20bits.U3EIP0
#define _U3EIP1 IPC20bits.U3EIP1
#define _U3EIP2 IPC20bits.U3EIP2
#define _U3RXIP0 IPC20bits.U3RXIP0
#define _U3RXIP1 IPC20bits.U3RXIP1
#define _U3RXIP2 IPC20bits.U3RXIP2
#define _U3TXIP0 IPC20bits.U3TXIP0
#define _U3TXIP1 IPC20bits.U3TXIP1
#define _U3TXIP2 IPC20bits.U3TXIP2

/* IPC21 */
#define _USB1IP IPC21bits.USB1IP
#define _U4EIP IPC21bits.U4EIP
#define _USB1IP0 IPC21bits.USB1IP0
#define _USB1IP1 IPC21bits.USB1IP1
#define _USB1IP2 IPC21bits.USB1IP2
#define _U4EIP0 IPC21bits.U4EIP0
#define _U4EIP1 IPC21bits.U4EIP1
#define _U4EIP2 IPC21bits.U4EIP2

/* IPC22 */
#define _U4RXIP IPC22bits.U4RXIP
#define _U4TXIP IPC22bits.U4TXIP
#define _SPI3EIP IPC22bits.SPI3EIP
#define _SPI3IP IPC22bits.SPI3IP
#define _U4RXIP0 IPC22bits.U4RXIP0
#define _U4RXIP1 IPC22bits.U4RXIP1
#define _U4RXIP2 IPC22bits.U4RXIP2
#define _U4TXIP0 IPC22bits.U4TXIP0
#define _U4TXIP1 IPC22bits.U4TXIP1
#define _U4TXIP2 IPC22bits.U4TXIP2
#define _SPI3EIP0 IPC22bits.SPI3EIP0
#define _SPI3EIP1 IPC22bits.SPI3EIP1
#define _SPI3EIP2 IPC22bits.SPI3EIP2
#define _SPI3IP0 IPC22bits.SPI3IP0
#define _SPI3IP1 IPC22bits.SPI3IP1
#define _SPI3IP2 IPC22bits.SPI3IP2

/* IPC23 */
#define _OC9IP IPC23bits.OC9IP
#define _IC9IP IPC23bits.IC9IP
#define _PWM1IP IPC23bits.PWM1IP
#define _PWM2IP IPC23bits.PWM2IP
#define _OC9IP0 IPC23bits.OC9IP0
#define _OC9IP1 IPC23bits.OC9IP1
#define _OC9IP2 IPC23bits.OC9IP2
#define _IC9IP0 IPC23bits.IC9IP0
#define _IC9IP1 IPC23bits.IC9IP1
#define _IC9IP2 IPC23bits.IC9IP2
#define _PWM1IP0 IPC23bits.PWM1IP0
#define _PWM1IP1 IPC23bits.PWM1IP1
#define _PWM1IP2 IPC23bits.PWM1IP2
#define _PWM2IP0 IPC23bits.PWM2IP0
#define _PWM2IP1 IPC23bits.PWM2IP1
#define _PWM2IP2 IPC23bits.PWM2IP2

/* IPC24 */
#define _PWM3IP IPC24bits.PWM3IP
#define _PWM4IP IPC24bits.PWM4IP
#define _PWM5IP IPC24bits.PWM5IP
#define _PWM6IP IPC24bits.PWM6IP
#define _PWM3IP0 IPC24bits.PWM3IP0
#define _PWM3IP1 IPC24bits.PWM3IP1
#define _PWM3IP2 IPC24bits.PWM3IP2
#define _PWM4IP0 IPC24bits.PWM4IP0
#define _PWM4IP1 IPC24bits.PWM4IP1
#define _PWM4IP2 IPC24bits.PWM4IP2
#define _PWM5IP0 IPC24bits.PWM5IP0
#define _PWM5IP1 IPC24bits.PWM5IP1
#define _PWM5IP2 IPC24bits.PWM5IP2
#define _PWM6IP0 IPC24bits.PWM6IP0
#define _PWM6IP1 IPC24bits.PWM6IP1
#define _PWM6IP2 IPC24bits.PWM6IP2

/* IPC29 */
#define _DMA8IP IPC29bits.DMA8IP
#define _DMA9IP IPC29bits.DMA9IP
#define _DMA8IP0 IPC29bits.DMA8IP0
#define _DMA8IP1 IPC29bits.DMA8IP1
#define _DMA8IP2 IPC29bits.DMA8IP2
#define _DMA9IP0 IPC29bits.DMA9IP0
#define _DMA9IP1 IPC29bits.DMA9IP1
#define _DMA9IP2 IPC29bits.DMA9IP2

/* IPC30 */
#define _DMA10IP IPC30bits.DMA10IP
#define _DMA11IP IPC30bits.DMA11IP
#define _SPI4EIP IPC30bits.SPI4EIP
#define _SPI4IP IPC30bits.SPI4IP
#define _DMA10IP0 IPC30bits.DMA10IP0
#define _DMA10IP1 IPC30bits.DMA10IP1
#define _DMA10IP2 IPC30bits.DMA10IP2
#define _DMA11IP0 IPC30bits.DMA11IP0
#define _DMA11IP1 IPC30bits.DMA11IP1
#define _DMA11IP2 IPC30bits.DMA11IP2
#define _SPI4EIP0 IPC30bits.SPI4EIP0
#define _SPI4EIP1 IPC30bits.SPI4EIP1
#define _SPI4EIP2 IPC30bits.SPI4EIP2
#define _SPI4IP0 IPC30bits.SPI4IP0
#define _SPI4IP1 IPC30bits.SPI4IP1
#define _SPI4IP2 IPC30bits.SPI4IP2

/* IPC31 */
#define _OC10IP IPC31bits.OC10IP
#define _IC10IP IPC31bits.IC10IP
#define _OC11IP IPC31bits.OC11IP
#define _IC11IP IPC31bits.IC11IP
#define _OC10IP0 IPC31bits.OC10IP0
#define _OC10IP1 IPC31bits.OC10IP1
#define _OC10IP2 IPC31bits.OC10IP2
#define _IC10IP0 IPC31bits.IC10IP0
#define _IC10IP1 IPC31bits.IC10IP1
#define _IC10IP2 IPC31bits.IC10IP2
#define _OC11IP0 IPC31bits.OC11IP0
#define _OC11IP1 IPC31bits.OC11IP1
#define _OC11IP2 IPC31bits.OC11IP2
#define _IC11IP0 IPC31bits.IC11IP0
#define _IC11IP1 IPC31bits.IC11IP1
#define _IC11IP2 IPC31bits.IC11IP2

/* IPC32 */
#define _OC12IP IPC32bits.OC12IP
#define _IC12IP IPC32bits.IC12IP
#define _DMA12IP IPC32bits.DMA12IP
#define _DMA13IP IPC32bits.DMA13IP
#define _OC12IP0 IPC32bits.OC12IP0
#define _OC12IP1 IPC32bits.OC12IP1
#define _OC12IP2 IPC32bits.OC12IP2
#define _IC12IP0 IPC32bits.IC12IP0
#define _IC12IP1 IPC32bits.IC12IP1
#define _IC12IP2 IPC32bits.IC12IP2
#define _DMA12IP0 IPC32bits.DMA12IP0
#define _DMA12IP1 IPC32bits.DMA12IP1
#define _DMA12IP2 IPC32bits.DMA12IP2
#define _DMA13IP0 IPC32bits.DMA13IP0
#define _DMA13IP1 IPC32bits.DMA13IP1
#define _DMA13IP2 IPC32bits.DMA13IP2

